#include <stdio.h>

void countCall() {
    int counter = 0;
    counter++;
    printf("Call Function: Counter =  %d\n", counter);
}
int main() {
    printf("Starting function calls...\n");
    countCall();  
    printf("After first call:\n");
    countCall();  
    return 0;
}

/* 1. ผลลัพธ์ที่ได้ต่างกันอย่างไร? เพราะเหตุใด?
กรณีที่ 1 (static): ค่าของ counter จะไม่ถูกรีเซ็ตในแต่ละครั้งที่การเรียกฟังก์ชัน
เช่น: 1 → 2 → 3
กรณีที่ 2 (non-static): ค่าของ counter จะเริ่มต้นที่ 0 ทุกครั้งเมื่อเรียกฟังก์ชัน
เช่น: 1 → 1 → 1
เพราะตัวแปร static ถูกสร้างครั้งเดียว และเก็บค่าไว้ตลอดในขณะที่ int ธรรมดาจะสร้างใหม่ทุกครั้งที่เรียกฟังก์ชัน 
2. ความแตกต่างสำคัญของ Non-Static Variable?
ตัวแปรที่ไม่เป็น static จะถูกสร้างใหม่ทุกครั้งที่มีการเรียกฟังก์ชัน และค่าของตัวแปรจะไม่คงอยู่ระหว่างการเรียกใช้งานครั้งก่อนหน้า
3. อภิปราย และสรุปผลที่ได้จากการทดลอง
ตัวแปร static ถูกสร้างครั้งเดียว และคงอยู่ตลอดการทำงานของโปรแกรมในบล็อกที่มันถูกประกาศ
ต่างจากตัวแปรแบบ non-static ที่สร้างใหม่ทุกครั้งเมื่อฟังก์ชันถูกเรียก
ตัวแปร static จึงเหมาะสำหรับการเก็บข้อมูลที่ต้องการใช้งานต่อเนื่อง เช่น ตัวนับจำนวนการเรียก
การเข้าใจเรื่อง static และ non-static มีความสำคัญในการเขียนโปรแกรมที่มีการจัดการข้อมูลที่มีสถานะ (state) */
