#include <stdio.h>
int main() {
    float score = 90.5;
    printf("Score = %.1f\n", score);
    return 0;
}

/*1.ผลลัพธ์ที่ได้ของ int คือ: Score = 90  
ผลลัพธ์ที่ได้ของ float คือ: Score = 90.5
2.เหตุผลที่ต้องเลือก Data Type ให้ถูกต้อง?  
เนื่องจากหากเลือกชนิดข้อมูลไม่เหมาะสม เช่น ใช้ int แทน float จะไม่สามารถเก็บค่าทศนิยมได้ ทำให้ข้อมูลผิดเพี้ยน
3.อธิบายและสรุปผล  
จากการทดลองพบว่า int เหมาะสำหรับจัดเก็บจำนวนเต็มเท่านั้น ไม่สามารถเก็บค่าทศนิยมได้  
ส่วน float เหมาะกับการจัดเก็บค่าที่มีทศนิยมและสามารถแสดงผลได้อย่างถูกต้องและละเอียดมากกว่า */